Public Member Functions | Protected Member Functions | List of all members
ACAPI::v1::ElementBase Class Reference
Element Manager API
A base class for all elements. More...
#include <ElementBase.hpp>
 Inheritance diagram for ACAPI::v1::ElementBase:
 Public Member Functions
UniqueID  | GetElemId () const
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
const API_Token &  | GetToken () const
 Protected Member Functions
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
std::shared_ptr< Impl::ObjectImpl >  | mImpl
Detailed Description
A base class for all elements.
Constructor & Destructor Documentation
◆ ElementBase()
 ACAPI::v1::ElementBase::ElementBase  |  ( |  std::shared_ptr< Impl::ObjectImpl >  |  impl | )
protected
Member Function Documentation
◆ GetElemId()
 UniqueID ACAPI::v1::ElementBase::GetElemId  |  ( |   | ) |   const